DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/sdspi/SDSPITiva.c
/*
 *  ======== SDSPITiva_close ========
 *  Function to unmount the FatFs filesystem and unregister the SDSPITiva
 *  disk I/O functions from SYS/BIOS' FatFS module.
 *
 *  @param  handle      SDSPI_Handle returned by SDSPI_open()
 */
void SDSPITiva_close(SDSPI_Handle handle)
{
    unsigned int               key;
    DRESULT                    dresult;
    FRESULT                    fresult;
    SDSPITiva_Object          *object = handle->object;
    SDSPITiva_HWAttrs const   *hwAttrs = handle->hwAttrs;

    /* Unmount the FatFs drive */
    fresult = f_mount(object->driveNumber, NULL);
    if (fresult != FR_OK) {
        Log_print2(Diags_USER1,
                   "SDSPI:(%p) Could not unmount FatFs volume @ drive number %d",
                   hwAttrs->baseAddr,
                   object->driveNumber);
    }

    /* Unregister the disk_*() functions */
    dresult = disk_unregister(object->driveNumber);
    if (dresult != RES_OK) {
        Log_print2(Diags_USER1,
                   "SDSPI:(%p) Error unregistering disk functions @ drive number %d",
                   hwAttrs->baseAddr,
                   object->driveNumber);
    }

    SSIDisable(hwAttrs->baseAddr);

    Log_print1(Diags_USER1, "SDSPI:(%p) closed", hwAttrs->baseAddr);

    key = Hwi_disable();
    object->driveNumber = DRIVE_NOT_MOUNTED;
    Hwi_restore(key);
}

/*
 *  ======== SDSPITiva_control ========
 *  @pre    Function assumes that the handle is not NULL
 */
int SDSPITiva_control(SDSPI_Handle handle, unsigned int cmd, void *arg)
{
	/* No implementation yet */
	return (SDSPI_STATUS_UNDEFINEDCMD);
}

/*
 *  ======== SDSPITiva_diskInitialize ========
 *  Function to initialize the SD Card.  This function is called by the FatFs
 *  module and must not be called by the application!
 *
 *  @param  drv         Drive Number
 */
DSTATUS SDSPITiva_diskInitialize(BYTE drv)
{
    uint8_t                    n;
    uint8_t                    ocr[4];
    SDSPITiva_CardType         cardType;
    Types_FreqHz               freq;
    uint32_t                   timestampTimeout;
    uint32_t                   timestampStart;
    uint32_t                   timestampCurrent;
    SDSPITiva_Object          *object = sdspiHandles[drv]->object;
    SDSPITiva_HWAttrs const   *hwAttrs = sdspiHandles[drv]->hwAttrs;

    /* No card in the socket */
    if (object->diskState & STA_NODISK) {
        Log_error1("SDSPI:(%p) disk initialization failed: No disk",
                    hwAttrs->baseAddr);

        return (object->diskState);
    }

    /* Initialize the SD Card for SPI mode */
    send_initial_clock_train(hwAttrs);

    /* Select the SD Card's chip select */
    takeSPIBus(hwAttrs);
    cardType = NOCARD;

    /* Send the CMD0 to put the SD Card in "Idle" state */
    if (send_cmd(hwAttrs, CMD0, 0) == 1) {

        /*
         * Determine what SD Card version we are dealing with
         * Depending on which SD Card version, we need to send different SD
         * commands to the SD Card, which will have different response fields.
         */

        if (send_cmd(hwAttrs, CMD8, 0x1AA) == 1) {
            /* SDC Ver2+ */
            for (n = 0; n < 4; n++) {
                ocr[n] = rxSPI(hwAttrs);
            }

            /*
             * Ensure that the card's voltage range is valid
             * The card can work at vdd range of 2.7-3.6V
             */
            if ((ocr[2] == 0x01) && (ocr[3] == 0xAA)) {
                /* Wait for data packet in timeout of 1s */
                timestampStart = Timestamp_get32();
                timestampTimeout = timestampStart + 1000 * mSScalingFactor;
                if (timestampTimeout > timestampStart) {
                    timestampStart = ~0;
                }
                do {
                    /* ACMD41 with HCS bit */
                    if (send_cmd(hwAttrs, CMD55, 0) <= 1 &&
                        send_cmd(hwAttrs, CMD41, 1UL << 30) == 0) {
                        timestampTimeout = 0;
                        break;
                    }
                    timestampCurrent = Timestamp_get32();
                } while ((timestampCurrent <= timestampTimeout) ||
                         (timestampCurrent >= timestampStart));

                /*
                 * Check CCS bit to determine which type of capacity we are
                 * dealing with
                 */
                if ((!timestampTimeout) && send_cmd(hwAttrs, CMD58, 0) == 0) {
                    for (n = 0; n < 4; n++) {
                        ocr[n] = rxSPI(hwAttrs);
                    }
                    cardType = (ocr[0] & 0x40) ? SDHC : SDSC;
                }
            }
        }

        /* SDC Ver1 or MMC */
        else {
            /*
             * The card version is not SDC V2+ so check if we are dealing with a
             * SDC or MMC card
             */
            if ((send_cmd(hwAttrs, CMD55, 0) <= 1 &&
                 send_cmd(hwAttrs, CMD41, 0) <= 1)) {
                cardType = SDSC;
            }
            else {
                cardType = MMC;
            }

            /* Wait for data packet in timeout of 1s */
            timestampStart = Timestamp_get32();
            timestampTimeout = timestampStart + 1000 * mSScalingFactor;
            if (timestampTimeout > timestampStart) {
                timestampStart = ~0;
            }
            do {
                if (cardType == SDSC) {
                    /* ACMD41 */
                    if (send_cmd(hwAttrs, CMD55, 0) <= 1 &&
                        send_cmd(hwAttrs, CMD41, 0) == 0) {
                        timestampTimeout = 0;
                        break;
                    }
                }
                else {
                    /* CMD1 */
                    if (send_cmd(hwAttrs, CMD1, 0) == 0) {
                        timestampTimeout = 0;
                        break;
                    }
                }
                timestampCurrent = Timestamp_get32();
            } while ((timestampCurrent <= timestampTimeout) ||
                     (timestampCurrent >= timestampStart));

            /* Select R/W block length */
            if ((timestampTimeout) || send_cmd(hwAttrs, CMD16, SD_SECTOR_SIZE) != 0) {
                cardType = NOCARD;
            }
        }
    }

    object->cardType = cardType;

    /* Deselect the SD Card's chip select */
    releaseSPIBus(hwAttrs);

    /* Idle (Release DO) */
    rxSPI(hwAttrs);

    /* Check to see if a card type was determined */
    if (cardType != NOCARD) {
        /* Reconfigure the SPI bust at the new frequency rate */
        BIOS_getCpuFreq(&freq);
        SSIDisable(hwAttrs->baseAddr);

        SSIConfigSetExpClk(hwAttrs->baseAddr,
                           freq.lo,
                           SSI_FRF_MOTO_MODE_0,
                           SSI_MODE_MASTER,
                           object->bitRate,
                           8);

